// Business Logic
const repository = require('./repository');
const AppError = require('../errors/AppError');


/****************************************************************************************************
 *  제휴업체 - 메뉴명 또는 업무명                                                                     *
 ****************************************************************************************************/
async function functionTemplate({ }) {
  const template = await repository.functionTemplate({});

  return template;
}



/****************************************************************************************************
 *  제휴업체 - 메뉴명 또는 업무명                                                                     *
 ****************************************************************************************************/



module.exports = {
};
